month = int(input("Введите порядковый номер месяца: "))

monthdict = {
    "1": "Зима",
    "2": "Зима",
    "3": "Весна",
    "4": "Весна",
    "5": "Весна",
    "6": "Лето",
    "7": "Лето",
    "8": "Лето",
    "9": "Осень",
    "10": "Осень",
    "11": "Осень",
    "12": "Зима",
}
monthlist = ["Зима", "Зима", "Весна", "Весна", "Весна", "Лето", "Лето", "Лето", "Осень", "Осень", "Осень", "Зима"]

print(f'Выводим время года через list: {monthlist[month - 1]}')
print(f'Выводим время года через простой словарь dict: {monthdict[str(month)]}')

mdict = {
    "Зима": [1, 2, 12],
    "Весна": [3, 4, 5],
    "Лето": [6, 7, 8],
    "Осень": [9, 10, 11]
}

for k, v in mdict.items():
    for element in v:
        if month == element:
            print(f'Выводим время года через словарь со списком значений: {k}')
